# running in txuart/src/
read_verilog -DTXUART -formal txuart.v
prep -top txuart

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
