[tasks]
bound
prf
cvr

[options]
bound:  mode bmc
bound:  depth 64
prf:    mode prove
prf:    depth 8
cvr:    mode cover
cvr:    depth 64
cvr:    append 20

[engines]
bound:  smtbmc
prf:    smtbmc yices
cvr:    smtbmc

[script]
read_verilog -sv -DAPB_MASTER -formal test_fm.sv
read_rtlil mutated.il
prep -top testbench
flatten
opt -fast

[files]
test_fm.sv
mutated.il
